print("alifattahi")

for num in range(1, 3001):
    print(num)



lists = []

# لیست کشورها
countries = ["ایران", "آمریکا", "فرانسه", "ژاپن", "استرالیا", "کانادا", "انگلستان", "آلمان", "روسیه", "برزیل"]
lists.append(countries)

# لیست اسامی ایرانی
iranian_names = ["مهدی", "سارا", "علی", "نیلوفر", "رضا", "زهرا", "حسین", "مریم", "محمد", "نازنین"]
lists.append(iranian_names)

# لیست نام شهرها
cities = ["تهران", "شیراز", "اصفهان", "مشهد", "تبریز", "یزد", "رشت", "کرمانشاه", "اهواز", "کرج"]
lists.append(cities)

# لیست نام شرکت‌های خودروسازی
car_companies = ["بنز", "تویوتا", "فورد", "هیوندای", "شورولت", "بی‌ام‌و", "اوپل", "هوندا", "نیسان", "فولکس‌واگن"]
lists.append(car_companies)

# لیست نام شرکت‌های غذایی
food_companies = ["کوکاکولا", "نستله", "دانون", "پپسی", "میلکا", "لایف", "نوشابه سینا", "رایتون", "بستل", "آبمیوه خلیج فارس"]
lists.append(food_companies)

# لیست نام‌های خانوادگی
last_names = ["احمدی", "رضایی", "خسروی", "فراهانی", "محمدی", "میرزایی", "صادقی", "قاسمی", "کریمی", "نوروزی"]
lists.append(last_names)

# لیست نام تیم‌های فوتبال
football_teams = ["برشلونا", "رئال مادرید", "منچستر یونایتد", "لیورپول", "بایرن مونیخ", "یوونتوس", "پاریس سنت ژرمن", "میلان", "تاتنهام", "منچستر سیتی"]
lists.append(football_teams)

# لیست نام بازیکنان فوتبال
football_players = ["مسی", "رونالدو", "نیمار", "اوبامیانگ", "مبابه", "صلاح", "کانته", "دی بروین", "هازارد", "ویران"]
lists.append(football_players)

# لیست نام فیلم‌ها
movies = ["آواتار", "تایتانیک", "جنگ ستارگان", "ماتریکس", "افسانه آمریکن پای", "شوالیه تاریکی", "فیلم جدید", "بردگان اسکار", "برباد رفته", "پیانو"]
lists.append(movies)

# لیست اعداد از 1 تا 50
numbers = list(range(1, 51))
lists.append(numbers)

for my_list in lists:
    print(my_list)


grade = 0
exams = 0

while grade < 20:
    exams += 1
    grade = (grade * (exams - 1) + float(input(f"نمره درس {exams}: "))) / exams

print("معدل شما برابر یا بیشتر از 20 است!")
print("تبریک! شما یک دوچرخه دریافت می‌کنید.")




password = "mypassword"

user_input = input("لطفاً پسورد را وارد کنید: ")

while user_input != password:
    print("پسورد اشتباه است!")
    user_input 
    
    
